# Preprocessing with Python

# Outline
* Import Dataset
* Explore Data
* Missing Data
* Imputation

## Import Library

In [1]:
import pandas as pd

# Import Dataset

Pandas memiliki function yang disiapkan untuk mengimport berbagai jenis file.

Untuk `csv` dan `txt` digunakan `read_csv`

## CSV File

Data yang tersedia berada di dalam folder `data`

Karena data yang kita gunakan merupakan tipe file `csv`, maka kita gunakan `read_csv`.

Pandas mengasumsikan bahwa setiap bagian terpisah dengan notasi ",". Tetapi dataset yang kita gunakan memiliki bagian-bagian yang terpisah dengan ";".

In [2]:
# membuka dokumentasi fungsi read_csv
pd.read_csv?

In [3]:
data = pd.read_csv("hr_data.csv", sep=";")

In [4]:
data

,Unnamed: 0,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,division,salary
0,0,NaN,0.53,2,157,3,0,1,0,sales,NaN
1,1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,2,0.11,NaN,7,272,4,0,1,0,NaN,medium
3,3,0.72,0.87,5,223,5,0,1,0,sales,low
4,4,0.37,0.52,2,159,3,0,1,0,sales,low
5,5,0.41,0.50,2,153,3,0,1,0,sales,low
6,6,0.10,0.77,6,247,4,0,1,0,sales,low
7,7,0.92,0.85,5,259,5,0,1,0,sales,low
8,8,0.89,1.00,5,224,5,0,1,0,sales,low
9,9,0.42,0.53,2,142,3,0,1,0,sales,low
10,10,0.45,0.54,2,135,3,0,1,0,sales,low
11,11,0.11,0.81,6,305,4,0,1,0,sales,low
12,12,0.84,0.92,4,234,5,0,1,0,sales,low
13,13,0.41,0.55,2,148,3,0,1,0,sales,low
14,14,0.36,0.56,2,137,3,0,1,0,sales,low
15,15,0.38,0.54,2,143,3,0,1,0,sales,low
16,16,0.45,0.47,2,160,3,0,1,0,sales,low
17,17,0.78,0.99,4,255,6,0,1,0,sales,low
18,18,0.45,0.51,2,160,3,1,1,1,sales,low
19,19,0.76,0.89,5,262,5,0,1,0,sales,low
20,20,0.11,0.83,6,282,4,0,1,0,sales,low
21,21,0.38,0.55,2,147,3,0,1,0,sales,low
22,22,0.09,0.95,6,304,4,0,1,0,sales,low
23,23,0.46,0.57,2,139,3,0,1,0,sales,low
24,24,0.40,0.53,2,158,3,0,1,0,sales,low
25,25,0.89,0.92,5,242,5,0,1,0,sales,low
26,26,0.82,0.87,4,239,5,0,1,0,sales,low
27,27,0.40,0.49,2,135,3,0,1,0,sales,low
28,28,0.41,0.46,2,128,3,0,1,0,accounting,low
29,29,0.38,0.50,2,132,3,0,1,0,accounting,low
...,...,...,...,...,...,...,...,...,...,...,...
14969,14969,0.43,NaN,2,157,3,0,1,0,sales,medium
14970,14970,0.78,NaN,4,225,5,0,1,0,sales,medium
14971,14971,0.39,NaN,2,140,3,0,1,0,sales,medium
14972,14972,0.11,NaN,6,310,4,0,1,0,accounting,medium
14973,14973,0.36,NaN,2,143,3,0,1,0,accounting,medium
14974,14974,0.36,NaN,2,153,3,0,1,0,accounting,medium
14975,14975,0.10,NaN,7,310,4,0,1,0,hr,medium
14976,14976,0.40,NaN,2,136,3,0,1,0,hr,medium
14977,14977,0.81,NaN,4,251,6,0,1,0,hr,medium
14978,14978,0.40,NaN,2,144,3,0,1,0,hr,medium
14979,14979,0.09,NaN,6,296,4,0,1,0,technical,medium
14980,14980,0.76,NaN,5,238,5,0,1,0,technical,high
14981,14981,0.73,NaN,5,162,4,0,1,0,technical,low
14982,14982,0.38,NaN,2,137,3,0,1,0,technical,medium
14983,14983,0.72,NaN,5,257,5,0,1,0,technical,medium
14984,14984,0.40,NaN,2,148,3,0,1,0,technical,medium
14985,14985,0.91,NaN,5,254,5,0,1,0,technical,medium
14986,14986,0.85,NaN,4,247,6,0,1,0,technical,low
14987,14987,0.90,NaN,5,206,4,0,1,0,technical,low
14988,14988,0.46,NaN,2,145,3,0,1,0,technical,low
14989,14989,0.43,NaN,2,159,3,1,1,0,technical,low
14990,14990,0.89,NaN,5,228,5,1,1,0,support,low
14991,14991,0.09,NaN,6,257,4,0,1,0,support,low
14992,14992,0.40,NaN,2,155,3,0,1,0,support,low
14993,14993,0.76,NaN,6,293,6,0,1,0,support,low
14994,14994,0.40,NaN,2,151,3,0,1,0,support,low
14995,14995,0.37,NaN,2,160,3,0,1,0,support,low
14996,14996,0.37,NaN,2,143,3,0,1,0,support,low
14997,14997,0.11,NaN,6,280,4,0,1,0,support,low
14998,14998,0.37,NaN,2,158,3,0,1,0,support,low

In [5]:
# menampilkan observasi teratas
data.head()

,Unnamed: 0,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,division,salary
0,0,NaN,0.53,2,157,3,0,1,0,sales,NaN
1,1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,2,0.11,NaN,7,272,4,0,1,0,NaN,medium
3,3,0.72,0.87,5,223,5,0,1,0,sales,low
4,4,0.37,0.52,2,159,3,0,1,0,sales,low

Hasil nya sangat susah untuk dibaca. Bagaimana mengatasinya?

`read_csv` memiliki parameter bernama `sep` yang digunakan untuk menentukan notasi pemisah. Agar data yang kita miliki lebih mudah untuk dibaca, `sep` akan sama dengan `";"`.

# Explore Data

## Data Shape

In [6]:
data.shape # (observasi, kolom)

(14999, 11)

In [7]:
data.columns

Index(['Unnamed: 0', 'satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'division', 'salary'],
      dtype='object')

## Value Counts and Proportion

In [8]:
data["left"].value_counts()

0    11428
1     3571
Name: left, dtype: int64

In [9]:
data["left"].value_counts(normalize=True)

0    0.761917
1    0.238083
Name: left, dtype: float64

## Duplicated Data

In [10]:
# check shape
data.shape

(14999, 11)

In [11]:
# Check if there are duplicates
data.duplicated().sum()

0

In [12]:
data = data.drop_duplicates()

# Missing Data

## Checking Missing Data

In [13]:
data.isnull().sum()

Unnamed: 0                 0
satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
left                       0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

## Handling Missing Values
* Drop
* Imputation

## Dropping Missing Values

In [14]:
data_hr_empty = data.dropna(axis=0)

In [15]:
data_hr_empty.isnull().sum()

Unnamed: 0               0
satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
division                 0
salary                   0
dtype: int64

In [16]:
data.shape

(14999, 11)

In [17]:
data_hr_empty.shape

(14430, 11)

In [18]:
data.isnull().sum()

Unnamed: 0                 0
satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
left                       0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

## Missing Values Imputation

Data imputation adalah proses pengisian data yang memiliki data yang kosong, biasanya diperlihatkan sebagai NaN

Proses tersebut terbagi menjadi 2:
* Numerical Imputation
* Categorical Imputation

<font color='red'>Split data menjadi input-output serta numerical dan categorical sebelum imputation</font>

# Split Input-Output

data = data_input + data_output <br>
data_input = data - data_output

In [19]:
data_output = data["left"] # mengambil kolom output
data_input  = data.drop(["left"], axis=1) # drop kolom output dari data, tersisa input

In [20]:
data_output.head()

0    1
1    1
2    1
3    1
4    1
Name: left, dtype: int64

In [21]:
# drop kolom tidak berguna
data_input = data_input.drop(["Unnamed: 0"], axis = 1)

In [22]:
data_input.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary
0,NaN,0.53,2,157,3,0,0,sales,NaN
1,0.80,0.86,5,262,6,0,0,sales,medium
2,0.11,NaN,7,272,4,0,0,NaN,medium
3,0.72,0.87,5,223,5,0,0,sales,low
4,0.37,0.52,2,159,3,0,0,sales,low

In [23]:
data_input.isnull().sum()

satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

In [24]:
data_input.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary
0,NaN,0.53,2,157,3,0,0,sales,NaN
1,0.80,0.86,5,262,6,0,0,sales,medium
2,0.11,NaN,7,272,4,0,0,NaN,medium
3,0.72,0.87,5,223,5,0,0,sales,low
4,0.37,0.52,2,159,3,0,0,sales,low

# Split Numeric and Categoric

data_input = data_numerical + data_categorical <br>
data_categorical = data - data_numerical

In [25]:
data_numerical = data_input._get_numeric_data()  # mengambil kolom numerik secara otomatis
data_numerical.head() # cek observasi teratas dari data

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years
0,NaN,0.53,2,157,3,0,0
1,0.80,0.86,5,262,6,0,0
2,0.11,NaN,7,272,4,0,0
3,0.72,0.87,5,223,5,0,0
4,0.37,0.52,2,159,3,0,0

Work_accident, promotion_last_5years memang berbentuk numerical, namun secara nilai bentuknya categorical <br>
Work_accident :: pernah mengalami kecelakaan selama kerja atau tidak <br>
promotion_last_5years :: pernah mendapatkan promosi atau tidak selama 5 tahun terakhir

In [26]:
num_cat = ["Work_accident","promotion_last_5years"]  # kolom categoric dalam bentuk numeric

In [27]:
data_numerical = data_numerical.drop(num_cat, axis=1)  # drop num_cat dari data_numerical
data_numerical.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company
0,NaN,0.53,2,157,3
1,0.80,0.86,5,262,6
2,0.11,NaN,7,272,4
3,0.72,0.87,5,223,5
4,0.37,0.52,2,159,3

In [28]:
data_numerical.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company'],
      dtype='object')

In [29]:
numerical = data_numerical.columns # kolom numerik

data_categorical = data - data_numeric

In [30]:
data_categorical = data_input.drop(numerical, axis=1) # drop kolom numerik, tersisa kolom kategorik
data_categorical.head()

   Work_accident  promotion_last_5years division  salary
0              0                      0    sales     NaN
1              0                      0    sales  medium
2              0                      0      NaN  medium
3              0                      0    sales     low
4              0                      0    sales     low

In [31]:
categorical = data_categorical.columns

# Missing Values Imputation

## Missing Values Imputation: Numerical

In [32]:
# import library untuk imputation
from sklearn.preprocessing import Imputer

In [33]:
# imputation menggunakan nilai median 
imput = Imputer(missing_values='NaN', strategy='median')

In [34]:
# fitting imputer ke data untuk menyimpan nilai median tiap kolom
imput.fit(data_numerical)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='median', verbose=0)

## Imputation Process

In [35]:
# Imputasi kolom numerik
imput.transform(data_numerical)

array([[6.50e-01, 5.30e-01, 2.00e+00, 1.57e+02, 3.00e+00],
       [8.00e-01, 8.60e-01, 5.00e+00, 2.62e+02, 6.00e+00],
       [1.10e-01, 7.20e-01, 7.00e+00, 2.72e+02, 4.00e+00],
       ...,
       [3.70e-01, 7.20e-01, 2.00e+00, 1.43e+02, 3.00e+00],
       [1.10e-01, 7.20e-01, 6.00e+00, 2.80e+02, 4.00e+00],
       [3.70e-01, 7.20e-01, 2.00e+00, 1.58e+02, 3.00e+00]])

In [36]:
data_numerical_imputed = pd.DataFrame(imput.transform(data_numerical)) # Membuat ke dalam bentuk DataFrame
data_numerical_imputed.head()

      0     1    2      3    4
0  0.65  0.53  2.0  157.0  3.0
1  0.80  0.86  5.0  262.0  6.0
2  0.11  0.72  7.0  272.0  4.0
3  0.72  0.87  5.0  223.0  5.0
4  0.37  0.52  2.0  159.0  3.0

In [37]:
# memperbaiki column dan index yang hilang
data_numerical_imputed.columns = data_numerical.columns
data_numerical_imputed.index   = data_numerical.index
data_numerical_imputed.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company
0,0.65,0.53,2.0,157.0,3.0
1,0.80,0.86,5.0,262.0,6.0
2,0.11,0.72,7.0,272.0,4.0
3,0.72,0.87,5.0,223.0,5.0
4,0.37,0.52,2.0,159.0,3.0

In [38]:
data_numerical_imputed.isnull().sum()

satisfaction_level      0
last_evaluation         0
number_project          0
average_montly_hours    0
time_spend_company      0
dtype: int64

## Missing Value: Categorical

In [39]:
# Cek data kosong pada data_categorical 
data_categorical.isnull().sum()

Work_accident              0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

In [40]:
data_categorical_imputed = data_categorical.fillna("KOSONG") # mengisi data kosong dengan nilai KOSONG
data_categorical_imputed.head()

   Work_accident  promotion_last_5years division  salary
0              0                      0    sales  KOSONG
1              0                      0    sales  medium
2              0                      0   KOSONG  medium
3              0                      0    sales     low
4              0                      0    sales     low

In [41]:
data_categorical_imputed.isnull().sum()

Work_accident            0
promotion_last_5years    0
division                 0
salary                   0
dtype: int64

In [42]:
# menggabungkan data_numerical dan data_categorical yang sudah diimputasi
data_input_clean = pd.concat([data_numerical_imputed, data_categorical_imputed], axis = 1)
data_input_clean.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary
0,0.65,0.53,2.0,157.0,3.0,0,0,sales,KOSONG
1,0.80,0.86,5.0,262.0,6.0,0,0,sales,medium
2,0.11,0.72,7.0,272.0,4.0,0,0,KOSONG,medium
3,0.72,0.87,5.0,223.0,5.0,0,0,sales,low
4,0.37,0.52,2.0,159.0,3.0,0,0,sales,low

In [43]:
# menggabungkan data_input yang sudah bersih dengan data output
data_clean = pd.concat([data_input_clean, data_output], axis=1)
data_clean.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary,left
0,0.65,0.53,2.0,157.0,3.0,0,0,sales,KOSONG,1
1,0.80,0.86,5.0,262.0,6.0,0,0,sales,medium,1
2,0.11,0.72,7.0,272.0,4.0,0,0,KOSONG,medium,1
3,0.72,0.87,5.0,223.0,5.0,0,0,sales,low,1
4,0.37,0.52,2.0,159.0,3.0,0,0,sales,low,1

In [44]:
# save to csv
data_clean.to_csv("hr_data_clean.csv")